In [7]:
import pandas as pd
import pymongo
client = pymongo.MongoClient("mongodb+srv://yashmohite:12345678ym@cluster0.urvqe3y.mongodb.net/?retryWrites=true&w=majority")
db = client.test #pointer 
print(db)

Database(MongoClient(host=['ac-d6qyvfk-shard-00-00.urvqe3y.mongodb.net:27017', 'ac-d6qyvfk-shard-00-02.urvqe3y.mongodb.net:27017', 'ac-d6qyvfk-shard-00-01.urvqe3y.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', authsource='admin', replicaset='atlas-lkhn33-shard-0', tls=True), 'test')

In [9]:
client.list_database_names()

['Test',
 'cricket',
 'ineuron',
 'planets',
 'police_line',
 'school',
 'taxis',
 'titanic',
 'admin',
 'local']

In [15]:
db = client['police_line']

In [19]:
collection = db["line_boys"]

In [21]:
data = list(collection.find())

In [24]:
df = pd.DataFrame(data)

In [25]:
df

,_id,name,age,hight,work,salary
0,63e2259af2a6bbcd2361a8bb,yash mohite,22,5.8ft,Data Scientist,120000
1,63e2259af2a6bbcd2361a8bc,yashika gor,22,5.5ft,Data Scientist,50000
2,63e2259af2a6bbcd2361a8bd,isha suryavanshi,23,5.4ft,Customer service,30000
3,63e2259af2a6bbcd2361a8be,ankita gurav,22,5.6ft,Customer service,25000
4,63e2259af2a6bbcd2361a8c0,siddhesh patade,22,5.7ft,Police Sub Inspector,50000
5,63e2259af2a6bbcd2361a8c1,rishik mahajan,22,5.9ft,Business Analyist,35000
6,63e2259af2a6bbcd2361a8c2,abhishake,28,5.10ft,Web Developer,120000

In [26]:
db = client['planets']

In [27]:
collection = db["records"]

In [29]:
data = list(collection.find())

In [31]:
data = pd.DataFrame(data)

In [34]:
data = data.iloc[:,[1,2,3,4,5,6]]

In [35]:
data

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]